{
    "Symbol": "TSLA",
    "AssetType": "Common Stock",
    "Name": "Tesla, Inc",
    "Description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits. It provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; and purchase financing and leasing services. This segment is also involved in the provision of non-warranty after-sales vehicle services, sale of used vehicles, retail merchandise, and vehicle insurance, as well as sale of products through its subsidiaries to third party customers; services for electric vehicles through its company-owned service locations, and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also offers service and repairs to its energy product customers, including under warranty; and various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was founded in 2003 and is headquartered in Palo Alto, California.",
    "CIK": "1318605",
    "Exchange": "NASDAQ",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Consumer Cyclical",
    "Industry": "Auto Manufacturers",
    "Address": "3500 Deer Creek Road, Palo Alto, CA, United States, 94304",
    "FullTimeEmployees": "70757",
    "FiscalYearEnd": "December",
    "LatestQuarter": "2021-03-31",
    "MarketCapitalization": "683424808960",
    "EBITDA": "4551000064",
    "PERatio": "710.8617",
    "PEGRatio": "4.2213",
    "BookValue": "23.901",
    "DividendPerShare": "None",
    "DividendYield": "0",
    "EPS": "0.998",
    "RevenuePerShareTTM": "38.052",
    "ProfitMargin": "0.0318",
    "OperatingMarginTTM": "0.0601",
    "ReturnOnAssetsTTM": "0.0299",
    "ReturnOnEquityTTM": "0.0716",
    "RevenueTTM": "35939999744",
    "GrossProfitTTM": "6630000000",
    "DilutedEPSTTM": "0.998",
    "QuarterlyEarningsGrowthYOY": "21.304",
    "QuarterlyRevenueGrowthYOY": "0.736",
    "AnalystTargetPrice": "636.35",
    "TrailingPE": "710.8617",
    "ForwardPE": "158.7302",
    "PriceToSalesRatioTTM": "22.0639",
    "PriceToBookRatio": "29.6922",
    "EVToRevenue": "18.8869",
    "EVToEBITDA": "144.8869",
    "Beta": "2.0105",
    "52WeekHigh": "895.9",
    "52WeekLow": "139.6",
    "50DayMovingAverage": "689.2062",
    "200DayMovingAverage": "654.9935",
    "SharesOutstanding": "959854016",
    "SharesFloat": "774113081",
    "SharesShort": "51176090",
    "SharesShortPriorMonth": "46269602",
    "ShortRatio": "1.5",
    "ShortPercentOutstanding": "0.05",
    "ShortPercentFloat": "0.0663",
    "PercentInsiders": "19.66",
    "PercentInstitutions": "45.868",
    "ForwardAnnualDividendRate": "0",
    "ForwardAnnualDividendYield": "0",
    "PayoutRatio": "0",
    "DividendDate": "None",
    "ExDividendDate": "None",
    "LastSplitFactor": "5:1",
    "LastSplitDate": "2020-08-31"
}
